# Python Group By

In [12]:
import pandas as pd
import numpy as np
df =pd.read_csv("nba.csv")

In [2]:
df.head()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0

In [9]:
#Grouping and perform count over each group
Team_num =  df.groupby('Team')['Team'].count()
print(Team_num.head())

Team
Atlanta Hawks        15
Boston Celtics       15
Brooklyn Nets        15
Charlotte Hornets    15
Chicago Bulls        15
Name: Team, dtype: int64

In [10]:
#Group by two keys and then summarize each group
Team_salary = df.groupby(['Team','Position'],as_index=False).Salary.mean()
print(Team_salary.head())

            Team Position        Salary
0  Atlanta Hawks        C  7.585417e+06
1  Atlanta Hawks       PF  5.988067e+06
2  Atlanta Hawks       PG  4.881700e+06
3  Atlanta Hawks       SF  3.000000e+06
4  Atlanta Hawks       SG  2.607758e+06

In [31]:
#Calculate an array of calculated column values, group records by them, and calculate the average salary
age_salary = df.groupby(np.floor((df.Age/10)),as_index=True).Salary.mean().to_frame()
age_salary.columns=['avg_salary']
print(age_salary.head())

       avg_salary
Age
1.0  1.930440e+06
2.0  4.340472e+06
3.0  6.304499e+06
4.0  4.666917e+06

In [34]:
#One aggregate on each of multiple columns
dept_agg =  df.groupby('Team',as_index=True).agg({'Team':'count','Salary':'mean'})
#Rename the columns
print(dept_agg.rename(columns={'Team':'Count','Salary':'AVG_SALARY'}).head())

                   Count    AVG_SALARY
Team
Atlanta Hawks         15  4.860197e+06
Boston Celtics        15  4.181505e+06
Brooklyn Nets         15  3.501898e+06
Charlotte Hornets     15  5.222728e+06
Chicago Bulls         15  5.785559e+06

In [35]:
#Multiple aggregates on one column
dept_agg = df.groupby('Team').Salary.agg(['count','mean']).reset_index()
#Rename columns
print(dept_agg.rename(columns={'count':'NUM','mean':'AVG_SALARY'}).head())

                Team  NUM    AVG_SALARY
0      Atlanta Hawks   15  4.860197e+06
1     Boston Celtics   14  4.181505e+06
2      Brooklyn Nets   15  3.501898e+06
3  Charlotte Hornets   15  5.222728e+06
4      Chicago Bulls   15  5.785559e+06

In [36]:
#Multiple aggregates over multiple columns
dept_agg = df.groupby('Team').agg({'Salary':['count','mean'],'Age':max})
#Rename columns
dept_agg.columns = ['NUM','AVG_SALARY','MAX_AGE']
print(dept_agg.reset_index().head())

                Team  NUM    AVG_SALARY  MAX_AGE
0      Atlanta Hawks   15  4.860197e+06     35.0
1     Boston Celtics   14  4.181505e+06     29.0
2      Brooklyn Nets   15  3.501898e+06     32.0
3  Charlotte Hornets   15  5.222728e+06     31.0
4      Chicago Bulls   15  5.785559e+06     35.0